evidence/adim-10-4/final/k6_100vu_raw.txt

         /\      Grafana   /ÔÇ¥ÔÇ¥/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ÔÇ¥ÔÇ¥\ 
  /          \   |   (  |  (ÔÇ¥)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: evidence\adim-10-4\k6\load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 47s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 17s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 020/100 VUs, 28 complete and 0 interrupted iterations
default   [   6% ] 020/100 VUs  01.0s/17.0s

running (02.0s), 040/100 VUs, 90 complete and 0 interrupted iterations
default   [  12% ] 040/100 VUs  02.0s/17.0s

running (03.0s), 060/100 VUs, 160 complete and 0 interrupted iterations
default   [  18% ] 060/100 VUs  03.0s/17.0s

running (04.0s), 079/100 VUs, 233 complete and 0 interrupted iterations
default   [  23% ] 079/100 VUs  04.0s/17.0s

running (05.0s), 099/100 VUs, 303 complete and 0 interrupted iterations
default   [  29% ] 099/100 VUs  05.0s/17.0s

running (06.0s), 100/100 VUs, 372 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  06.0s/17.0s

running (07.0s), 100/100 VUs, 414 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  07.0s/17.0s

running (08.0s), 100/100 VUs, 500 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  08.0s/17.0s

running (09.0s), 100/100 VUs, 582 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  09.0s/17.0s

running (10.0s), 100/100 VUs, 617 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  10.0s/17.0s

running (11.0s), 100/100 VUs, 703 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  11.0s/17.0s

running (12.0s), 100/100 VUs, 792 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  12.0s/17.0s

running (13.0s), 100/100 VUs, 835 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  13.0s/17.0s

running (14.0s), 100/100 VUs, 904 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  14.0s/17.0s

running (15.0s), 100/100 VUs, 998 complete and 0 interrupted iterations
default   [  88% ] 100/100 VUs  15.0s/17.0s

running (16.0s), 072/100 VUs, 1070 complete and 0 interrupted iterations
default   [  94% ] 072/100 VUs  16.0s/17.0s

running (17.0s), 019/100 VUs, 1154 complete and 0 interrupted iterations
default   [ 100% ] 019/100 VUs  17.0s/17.0s

     Ô£ô status is 200 or 401

     checks.........................: 100.00% 1173 out of 1173
     data_received..................: 163 MB  9.4 MB/s
     data_sent......................: 662 kB  38 kB/s
     http_req_blocked...............: avg=19.63ms  min=0s       med=0s       max=1.51s  p(90)=0s       p(95)=97.55ms 
     http_req_connecting............: avg=8.07ms   min=0s       med=0s       max=1.15s  p(90)=0s       p(95)=32.5ms  
     http_req_duration..............: avg=524.44ms min=11.79ms  med=212.02ms max=5.66s  p(90)=1.26s    p(95)=1.44s   
       { expected_response:true }...: avg=524.44ms min=11.79ms  med=212.02ms max=5.66s  p(90)=1.26s    p(95)=1.44s   
   Ô£ô http_req_failed................: 0.00%   0 out of 2346
     http_req_receiving.............: avg=398.45ms min=0s       med=40.31ms  max=5.49s  p(90)=1.12s    p(95)=1.3s    
     http_req_sending...............: avg=227.06┬Ás min=0s       med=0s       max=3.79ms p(90)=617.59┬Ás p(95)=705.09┬Ás
     http_req_tls_handshaking.......: avg=11.52ms  min=0s       med=0s       max=1.24s  p(90)=0s       p(95)=57.03ms 
     http_req_waiting...............: avg=125.76ms min=11.24ms  med=106.86ms max=1.07s  p(90)=207.11ms p(95)=303.34ms
     http_reqs......................: 2346    135.171194/s
     iteration_duration.............: avg=1.18s    min=172.06ms med=1.19s    max=5.85s  p(90)=1.73s    p(95)=2.04s   
     iterations.....................: 1173    67.585597/s
     vus............................: 19      min=19           max=100
     vus_max........................: 100     min=100          max=100


running (17.4s), 000/100 VUs, 1173 complete and 0 interrupted iterations
default Ô£ô [ 100% ] 000/100 VUs  17s