evidence/adim-10-4/final/k6_25vu_raw.txt

         /\      Grafana   /ÔÇ¥ÔÇ¥/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ÔÇ¥ÔÇ¥\ 
  /          \   |   (  |  (ÔÇ¥)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: evidence\adim-10-4\k6\load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 25 max VUs, 47s max duration (incl. graceful stop):
              * default: Up to 25 looping VUs for 17s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 05/25 VUs, 7 complete and 0 interrupted iterations
default   [   6% ] 05/25 VUs  01.0s/17.0s

running (02.0s), 10/25 VUs, 40 complete and 0 interrupted iterations
default   [  12% ] 10/25 VUs  02.0s/17.0s

running (03.0s), 15/25 VUs, 88 complete and 0 interrupted iterations
default   [  18% ] 15/25 VUs  03.0s/17.0s

running (04.0s), 20/25 VUs, 137 complete and 0 interrupted iterations
default   [  24% ] 20/25 VUs  04.0s/17.0s

running (05.0s), 24/25 VUs, 197 complete and 0 interrupted iterations
default   [  29% ] 24/25 VUs  05.0s/17.0s

running (06.0s), 25/25 VUs, 224 complete and 0 interrupted iterations
default   [  35% ] 25/25 VUs  06.0s/17.0s

running (07.0s), 25/25 VUs, 267 complete and 0 interrupted iterations
default   [  41% ] 25/25 VUs  07.0s/17.0s

running (08.0s), 25/25 VUs, 340 complete and 0 interrupted iterations
default   [  47% ] 25/25 VUs  08.0s/17.0s

running (09.0s), 25/25 VUs, 418 complete and 0 interrupted iterations
default   [  53% ] 25/25 VUs  09.0s/17.0s

running (10.0s), 25/25 VUs, 485 complete and 0 interrupted iterations
default   [  59% ] 25/25 VUs  10.0s/17.0s

running (11.0s), 25/25 VUs, 560 complete and 0 interrupted iterations
default   [  65% ] 25/25 VUs  11.0s/17.0s

running (12.0s), 25/25 VUs, 633 complete and 0 interrupted iterations
default   [  71% ] 25/25 VUs  12.0s/17.0s

running (13.0s), 25/25 VUs, 707 complete and 0 interrupted iterations
default   [  76% ] 25/25 VUs  13.0s/17.0s

running (14.0s), 25/25 VUs, 778 complete and 0 interrupted iterations
default   [  82% ] 25/25 VUs  14.0s/17.0s

running (15.0s), 25/25 VUs, 850 complete and 0 interrupted iterations
default   [  88% ] 25/25 VUs  15.0s/17.0s

running (16.0s), 17/25 VUs, 913 complete and 0 interrupted iterations
default   [  94% ] 17/25 VUs  16.0s/17.0s

running (17.0s), 01/25 VUs, 956 complete and 0 interrupted iterations
default   [ 100% ] 01/25 VUs  17.0s/17.0s

     Ô£ô status is 200 or 401

     checks.........................: 100.00% 957 out of 957
     data_received..................: 133 MB  7.7 MB/s
     data_sent......................: 518 kB  30 kB/s
     http_req_blocked...............: avg=3.13ms   min=0s       med=0s       max=1.13s    p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=1.77ms   min=0s       med=0s       max=1.06s    p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=125.35ms min=7.68ms   med=84.85ms  max=1.68s    p(90)=250.32ms p(95)=293.32ms
       { expected_response:true }...: avg=125.35ms min=7.68ms   med=84.85ms  max=1.68s    p(90)=250.32ms p(95)=293.32ms
   Ô£ô http_req_failed................: 0.00%   0 out of 1914
     http_req_receiving.............: avg=76.75ms  min=0s       med=9.24ms   max=1.32s    p(90)=190.03ms p(95)=230.8ms 
     http_req_sending...............: avg=219.71┬Ás min=0s       med=0s       max=4.55ms   p(90)=600.63┬Ás p(95)=709.5┬Ás 
     http_req_tls_handshaking.......: avg=1.18ms   min=0s       med=0s       max=208.71ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=48.38ms  min=6.28ms   med=42.49ms  max=413.16ms p(90)=79.47ms  p(95)=93.95ms 
     http_reqs......................: 1914    111.513444/s
     iteration_duration.............: avg=357.85ms min=158.06ms med=333.17ms max=2.03s    p(90)=437.03ms p(95)=533.62ms
     iterations.....................: 957     55.756722/s
     vus............................: 1       min=1          max=25
     vus_max........................: 25      min=25         max=25


running (17.2s), 00/25 VUs, 957 complete and 0 interrupted iterations
default Ô£ô [ 100% ] 00/25 VUs  17s