evidence/adim-10-4/final/k6_50vu_raw.txt

         /\      Grafana   /ÔÇ¥ÔÇ¥/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ÔÇ¥ÔÇ¥\ 
  /          \   |   (  |  (ÔÇ¥)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: evidence\adim-10-4\k6\load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 47s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 17s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (01.0s), 10/50 VUs, 20 complete and 0 interrupted iterations
default   [   6% ] 10/50 VUs  01.0s/17.0s

running (02.0s), 20/50 VUs, 69 complete and 0 interrupted iterations
default   [  12% ] 20/50 VUs  02.0s/17.0s

running (03.0s), 30/50 VUs, 137 complete and 0 interrupted iterations
default   [  18% ] 30/50 VUs  03.0s/17.0s

running (04.0s), 40/50 VUs, 205 complete and 0 interrupted iterations
default   [  23% ] 40/50 VUs  04.0s/17.0s

running (05.0s), 49/50 VUs, 253 complete and 0 interrupted iterations
default   [  29% ] 49/50 VUs  05.0s/17.0s

running (06.0s), 50/50 VUs, 345 complete and 0 interrupted iterations
default   [  35% ] 50/50 VUs  06.0s/17.0s

running (07.0s), 50/50 VUs, 418 complete and 0 interrupted iterations
default   [  41% ] 50/50 VUs  07.0s/17.0s

running (08.0s), 50/50 VUs, 505 complete and 0 interrupted iterations
default   [  47% ] 50/50 VUs  08.0s/17.0s

running (09.0s), 50/50 VUs, 567 complete and 0 interrupted iterations
default   [  53% ] 50/50 VUs  09.0s/17.0s

running (10.0s), 50/50 VUs, 628 complete and 0 interrupted iterations
default   [  59% ] 50/50 VUs  10.0s/17.0s

running (11.0s), 50/50 VUs, 722 complete and 0 interrupted iterations
default   [  65% ] 50/50 VUs  11.0s/17.0s

running (12.0s), 50/50 VUs, 786 complete and 0 interrupted iterations
default   [  71% ] 50/50 VUs  12.0s/17.0s

running (13.0s), 50/50 VUs, 870 complete and 0 interrupted iterations
default   [  76% ] 50/50 VUs  13.0s/17.0s

running (14.0s), 50/50 VUs, 935 complete and 0 interrupted iterations
default   [  82% ] 50/50 VUs  14.0s/17.0s

running (15.0s), 50/50 VUs, 1023 complete and 0 interrupted iterations
default   [  88% ] 50/50 VUs  15.0s/17.0s

running (16.0s), 31/50 VUs, 1108 complete and 0 interrupted iterations
default   [  94% ] 31/50 VUs  16.0s/17.0s

running (17.0s), 05/50 VUs, 1167 complete and 0 interrupted iterations
default   [ 100% ] 05/50 VUs  17.0s/17.0s

     Ô£ô status is 200 or 401

     checks.........................: 100.00% 1172 out of 1172
     data_received..................: 163 MB  9.5 MB/s
     data_sent......................: 621 kB  36 kB/s
     http_req_blocked...............: avg=5.12ms   min=0s       med=0s       max=717.72ms p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=1.58ms   min=0s       med=0s       max=120.78ms p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=237.71ms min=9.76ms   med=116.54ms max=3.01s    p(90)=563.85ms p(95)=621.68ms
       { expected_response:true }...: avg=237.71ms min=9.76ms   med=116.54ms max=3.01s    p(90)=563.85ms p(95)=621.68ms
   Ô£ô http_req_failed................: 0.00%   0 out of 2344
     http_req_receiving.............: avg=166.97ms min=0s       med=8.02ms   max=2.92s    p(90)=485.35ms p(95)=547.15ms
     http_req_sending...............: avg=190.35┬Ás min=0s       med=0s       max=7.31ms   p(90)=588.06┬Ás p(95)=680.39┬Ás
     http_req_tls_handshaking.......: avg=3.51ms   min=0s       med=0s       max=637.13ms p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=70.54ms  min=9.76ms   med=60.47ms  max=750.77ms p(90)=124.99ms p(95)=146.47ms
     http_reqs......................: 2344    136.106646/s
     iteration_duration.............: avg=586.47ms min=158.25ms med=600.08ms max=3.16s    p(90)=792.36ms p(95)=867.96ms
     iterations.....................: 1172    68.053323/s
     vus............................: 5       min=5            max=50
     vus_max........................: 50      min=50           max=50


running (17.2s), 00/50 VUs, 1172 complete and 0 interrupted iterations
default Ô£ô [ 100% ] 00/50 VUs  17s